000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.Контрагенты</types>
    <types>EnumRef.ГендерноеНазначение</types>
    <types>EnumRef.НазначенияКассККМ</types>
    <types>CatalogRef.СвойстваНоменклатуры</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>Boolean</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>String</types>
    <types>CatalogRef.ВозрастныеИнтервалы</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>Date</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Марки</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.Магазины</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВозрастнойИнтервал</name>
      <description>Возрастной интервал</description>
      <type>
        <types>CatalogRef.ВозрастныеИнтервалы</types>
      </type>
    </items>
    <items>
      <name>ГендерноеНазначение</name>
      <description>Гендерное назначение</description>
      <type>
        <types>EnumRef.ГендерноеНазначение</types>
      </type>
    </items>
    <items>
      <name>Коллекция</name>
      <description>Коллекция</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>КратностьЗаказа</name>
      <description>Кратность заказа в магазин</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>МатериалТовара</name>
      <description>Материал товара</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>МодельТовара</name>
      <description>Модель товара</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>НазначениеКассыККМ</name>
      <description>Назначение кассы ККМ</description>
      <type>
        <types>EnumRef.НазначенияКассККМ</types>
      </type>
    </items>
    <items>
      <name>РазмерностьТовара</name>
      <description>Размерность товара</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>Сезонность</name>
      <description>Сезонность</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>СкладОтраженВОстаткахДляИнтернетМагазина</name>
      <description>Склад отражен в остатках для интернет магазина</description>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>СрокБеременности</name>
      <description>Срок беременности (в неделях)</description>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>СтатусТовара</name>
      <description>Статус товара</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>СтранаПроисхождения</name>
      <description>Страна происхождения</description>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </items>
    <items>
      <name>ТорговыеМарки</name>
      <description>Торговые марки</description>
      <type>
        <types>CatalogRef.Марки</types>
      </type>
    </items>
    <items>
      <name>Фурнитура</name>
      <description>Фурнитура товара</description>
      <type>
        <types>CatalogRef.СвойстваНоменклатуры</types>
      </type>
    </items>
    <items>
      <name>Цвет</name>
      <description>Цвет</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СклоненияПредмета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/РаботаСФормами/Module.bsl
#Область УправлениеСортировкойТабличнойЧасти

Процедура ДобавитьКнопкиПорядкаКодАртикул(Форма, КоманднаяПанель, СписокКлючей = "")	Экспорт

	Если СписокКлючей = "" Тогда

		СписокКлючей = РаботаСФормамиПовтИсп.КлючиСортировки();

	КонецЕсли;

	ОписаниеКнопокФормы = Новый Массив;
	ДобавитьОписаниеКнопки("Код", "Код", ОписаниеКнопокФормы, СписокКлючей);
	ДобавитьОписаниеКнопки("Артикул", "Артикул", ОписаниеКнопокФормы, СписокКлючей);
	ДобавитьОписаниеКнопки("Производитель", "Производитель", ОписаниеКнопокФормы, СписокКлючей);
	ДобавитьОписаниеКнопки("ТорговаяМарка", "Торговая марка", ОписаниеКнопокФормы, СписокКлючей);
	ДобавитьОписаниеКнопки("ЦенаРазница", "Цена разница", ОписаниеКнопокФормы, СписокКлючей);

	СписокРеквизитов = Новый Массив;

	Для каждого ОписаниеКнопки Из ОписаниеКнопокФормы Цикл

	    КомандаФормы = Форма.Команды.Добавить(ОписаниеКнопки.Имя);
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	    КомандаФормы.Действие  = ОписаниеКнопки.Имя + "Нажатие";
		КомандаФормы.Заголовок = ОписаниеКнопки.Заголовок;
		КомандаФормы.Подсказка = ОписаниеКнопки.Подсказка;
		КомандаФормы.Картинка  = ОписаниеКнопки.Картинка;

	    КнопкаФормы  = Форма.Элементы.Добавить(ОписаниеКнопки.Имя, Тип("КнопкаФормы"), КоманднаяПанель);
		КнопкаФормы.Отображение = ОтображениеКнопки.КартинкаИТекст;
	    КнопкаФормы.ИмяКоманды  = ОписаниеКнопки.Имя;

		СписокРеквизитов.Добавить(Новый РеквизитФормы(ОписаниеКнопки.Имя, Новый ОписаниеТипов("Булево")));

	КонецЦикла;

	Форма.ИзменитьРеквизиты(СписокРеквизитов);

КонецПроцедуры

Процедура ДобавитьОписаниеКнопки(Имя, Заголовок, ОписаниеКнопокФормы, СписокКлючей)

	СоставНаправлений = Новый Массив;
	СоставНаправлений.Добавить("ПоВозрастанию");
	СоставНаправлений.Добавить("ПоУбыванию");

	Если РаботаСФормамиПовтИсп.СоответствиеКлючейСортировки(СписокКлючей).Получить(Имя) = Истина Тогда

		Для каждого Направление Из СоставНаправлений Цикл

			ОписаниеКнопокФормы.Добавить(ОписаниеКнопки(Имя, Направление, Заголовок));

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Функция ОписаниеКнопки(Имя, Направление, Заголовок)

	ОписаниеКнопки = Новый Структура(
		"Имя", "ТоварыПорядок" + Имя + Направление);
	ОписаниеКнопки.Вставить("Заголовок", "Сортировать по «" + Заголовок + "» "
		+ ?(Направление = "ПоВозрастанию", " возрастание", "убывание"));
	ОписаниеКнопки.Вставить("Подсказка", "Упорядочить табличную часть в соответствии с указанным порядком");
	ОписаниеКнопки.Вставить("Картинка", ?(Направление = "ПоВозрастанию"
		, БиблиотекаКартинок.СортироватьСписокПоВозрастанию
		, БиблиотекаКартинок.СортироватьСписокПоУбыванию));

	Возврат ОписаниеКнопки;

КонецФункции // ОписаниеКнопки()

Процедура ТоварыСортироватьПоРеквизитуНоменклатуры(ИмяРеквизита, Направление, Товары)	Экспорт
	Если ИмяРеквизита = "ТорговаяМарка" тогда
		Запрос = Новый Запрос(СтрЗаменить(  		
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки - 1 КАК Индекс,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
		|ИЗ
		|	Источник КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Источник.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Значение УБЫВ"
		, "УБЫВ",  Направление)
		);
		
	ИначеЕсли ИмяРеквизита = "ЦенаРазница" тогда
		Запрос = Новый Запрос(СтрЗаменить(
		"ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Товары.ЦенаНовая - Товары.Цена КАК ЦенаРазница
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки - 1 КАК Индекс,
		|	Источник.Номенклатура,
		|	Источник.Номенклатура.Код КАК КлючПорядка,
		|	Источник.ЦенаРазница КАК ЦенаРазница
		|ИЗ
		|	Источник КАК Источник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаРазница  УБЫВ"
		, "УБЫВ",  Направление)
		);
	Иначе
		Запрос = Новый Запрос(СтрЗаменить(СтрЗаменить(
		"ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки - 1 КАК Индекс,
		|	Источник.Номенклатура,
		|	Источник.Номенклатура.Код КАК КлючПорядка
		|ИЗ
		|	Источник КАК Источник
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлючПорядка УБЫВ"
		, ".Номенклатура.Код", ".Номенклатура." + ИмяРеквизита)
		, "КлючПорядка УБЫВ", "КлючПорядка " + Направление)
		);
	КонецЕсли;
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ИндексПорядка = 0;

	Пока Выборка.Следующий() Цикл

		Товары[Выборка.Индекс].НомерСтрокиПорядок = ИндексПорядка;
		ИндексПорядка = ИндексПорядка + 1;

	КонецЦикла;
	
	Товары.Сортировать("НомерСтрокиПорядок");

КонецПроцедуры

#КонецОбласти
